Autodesk.Revit.DB.SpatialElement.GetSpatialElementDomainData
Gets the domain data for the spatial element. The domain data contains information of different spatial elements, such as electrical load area. Currently room/space/area don't have domain data.
Returns:
Returns a pointer to the base class for specific domain requirements for the spatial element.
Since:
2023

Autodesk.Revit.DB.SpatialElement.SpatialElementType
The spatial element type.
Since:
2023

Autodesk.Revit.DB.SpatialElement
Represents an enclosed area or volume in the Revit model.